app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT `documents`.* FROM `documents` LIMIT 1

  def show
    @document = Document.find(params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

  def edit
    @document = Document.find(params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

  def create
    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save
---
INSERT INTO `documents` (`notes`, `description`, `deadline`, `assigned_to`, `requested_by`, `status`, `name`, `client`, `updated_at`, `created_at`) VALUES (NULL, 'dwqdqwdwfgewgwegweegwewg e gwweg egw ew ggew ', '2011-04-28', NULL, 'Danielle Li', 1, 'A new request', 'whoever', '2011-04-28 21:36:25', '2011-04-28 21:36:25')

  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 2 LIMIT 1
UPDATE `documents` SET `name` = 'My First Test', `client` = 'Valueworks', `assigned_to` = 'William Li', `description` = 'A little description in here', `updated_at` = '2011-04-25 21:26:25', `requested_by` = 'Danielle Li', `notes` = 'Some designer notes from Will' WHERE `documents`.`id` = 4

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
DELETE FROM `documents` WHERE `documents`.`id` = 1