app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`password`, `username`, `exclusive`, `name`, `salt`, `created_at`, `updated_at`, `email`) VALUES ('password', '', 0, 'William Li', NULL, '2011-05-03 20:38:07', '2011-05-03 20:38:07', 'willi287@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = 'William Li', `email` = 'willi287@gmail.com', `updated_at` = '2011-05-03 21:29:59' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])